sprint5-with-bugs/tests/performance/results/forgot_password_load_ab_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx
Server Hostname:        localhost
Server Port:            8091

Document Path:          /users/forgot-password
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   3.349 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      32400 bytes
Total body sent:        22500
HTML transferred:       1600 bytes
Requests per second:    29.86 [#/sec] (mean)
Time per request:       334.933 [ms] (mean)
Time per request:       33.493 [ms] (mean, across all concurrent requests)
Transfer rate:          9.45 [Kbytes/sec] received
                        6.56 kb/s sent
                        16.01 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   104  310  68.9    304     478
Waiting:      104  310  69.0    304     478
Total:        104  310  68.9    304     478

Percentage of the requests served within a certain time (ms)
  50%    304
  66%    330
  75%    343
  80%    362
  90%    413
  95%    439
  98%    447
  99%    478
 100%    478 (longest request)