sprint5-with-bugs/tests/performance/results/forgot_password_spike_ab_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx
Server Hostname:        localhost
Server Port:            8091

Document Path:          /users/forgot-password
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   2.555 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      32400 bytes
Total body sent:        22500
HTML transferred:       1600 bytes
Requests per second:    39.13 [#/sec] (mean)
Time per request:       255.550 [ms] (mean)
Time per request:       25.555 [ms] (mean, across all concurrent requests)
Transfer rate:          12.38 [Kbytes/sec] received
                        8.60 kb/s sent
                        20.98 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:   104  234  41.4    231     348
Waiting:      104  234  41.4    231     348
Total:        104  234  41.4    231     348

Percentage of the requests served within a certain time (ms)
  50%    231
  66%    251
  75%    261
  80%    265
  90%    285
  95%    292
  98%    332
  99%    348
 100%    348 (longest request)