sprint5-with-bugs/tests/performance/results/forgot_password_stress_ab_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx
Server Hostname:        localhost
Server Port:            8091

Document Path:          /users/forgot-password
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   2.457 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      32400 bytes
Total body sent:        22500
HTML transferred:       1600 bytes
Requests per second:    40.70 [#/sec] (mean)
Time per request:       245.684 [ms] (mean)
Time per request:       24.568 [ms] (mean, across all concurrent requests)
Transfer rate:          12.88 [Kbytes/sec] received
                        8.94 kb/s sent
                        21.82 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    94  226  37.1    225     305
Waiting:       94  226  37.1    225     305
Total:         94  226  37.1    225     305

Percentage of the requests served within a certain time (ms)
  50%    225
  66%    233
  75%    250
  80%    259
  90%    268
  95%    274
  98%    278
  99%    305
 100%    305 (longest request)